from instagrapi import Client
import random
import datetime

class Instagram:
    def __init__(self, app_id, username, password):
        self.app_id = app_id
        self.username = username
        self.password = password
        self.cl = Client()
        self.cl.login(username, password)
    
    def post(self, image_path, caption=None):
        if caption is None:
            caption = self.generate_caption()
        self.cl.photo_upload(image_path, caption)

    def generate_caption(self):
        emoji_face = ["😀", "😁", "😂", "🤣", "😃", "😄", "😅", "😆", "😉", "😊", "😋", "😎", "😍", "😘", "😗", "😙", "😚", "☺️", "🙂", "🤗", "🤔", "🤭", "🤫", "🤥", "😐", "😑", "😶", "😏", "😒", "🙄", "😬", "😌", "😔", "😪", "🤤", "😴", "😷", "🤒", "🤕", "🤢", "🤮", "🥵", "🥶", "😵", "🤯", "🤠", "🥳", "😎", "🤓", "🧐", "😕", "😟", "🙁", "☹️", "😮", "😯", "😲", "😳", "🥺", "😦", "😧", "😨", "😰", "😥", "😢", "😭", "😱", "😖", "😞", "😓", "😩", "😫", "🥱", "😤", "😡", "😠", "🤬", "🤯", "😷", "🤒", "🤕", "🤢", "🤮", "🥴", "🥺"]
        emoji_food = ["🍏", "🍎", "🍐", "🍊", "🍋", "🍌", "🍉", "🍇", "🍓", "🍈", "🍒", "🍑", "🥭", "🍍", "🥥", "🥝", "🍅", "🍆", "🥑", "🥦", "🥬", "🥒", "🌶️", "🌽", "🥕", "🧄", "🧅", "🥔", "🍠", "🥐", "🥯", "🍞", "🥖", "🥨", "🧀", "🥚", "🍳", "🧈", "🥞", "🧇", "🥓", "🥩", "🍗", "🍖", "🦴", "🌭", "🍔", "🍟", "🍕", "🥪", "🥙", "🧆", "🌮", "🌯", "🥗", "🥘", "🥫", "🍝", "🍜", "🍲", "🍛", "🍣", "🍱", "🥟", "🦪", "🍤", "🍙", "🍚", "🍘", "🍥", "🥮", "🥠", "🍢", "🍡", "🍧", "🍨", "🍦", "🥧", "🧁", "🍰", "🎂", "🍮", "🍭", "🍬", "🍫", "🍿", "🍩", "🍪", "🌰", "🥜", "🍯", "🥛", "🍼", "☕", "🍵", "🧃", "🥤", "🍶", "🍺", "🍻"]
        emoji_animal = ["🐶", "🐱", "🐭", "🐹", "🐰", "🐻", "🐼", "🐻‍❄️", "🐨", "🐯", "🦁", "🐮", "🐷", "🐽", "🐸", "🐵", "🙈", "🙉", "🙊", "🐒", "🐔", "🐧", "🐦", "🐤", "🐣", "🐥", "🦆", "🦅", "🦉", "🦇", "🐺", "🐗", "🐴", "🦄", "🐝", "🐛", "🦋", "🐌", "🐞", "🐜", "🦟", "🦗", "🕷️", "🕸️", "🦂", "🐢", "🐍", "🦎", "🦖", "🦕", "🐙", "🦑", "🦐", "🦞", "🦀", "🐡", "🐠", "🐟", "🐬", "🐳", "🐋", "🦈", "🐊", "🐅", "🐆", "🦓", "🦍", "🦧", "🦣", "🐘", "🦛", "🦏", "🐪", "🐫", "🦒", "🦘", "🦬", "🐃", "🐂", "🐄", "🐎", "🐖", "🐏", "🐑", "🦙", "🐐", "🦌", "🐕", "🐩", "🦮", "🐕‍🦺", "🐈", "🐈‍⬛", "🐓", "🦃", "🦚", "🦜"]
        emoji_malicious = ["👅", "👄", "🍌", "👀", "🍑", "🔥", "💣", "🐍", "👹", "👺", "👿", "💩", "🤡", "🌶️", "🍆", "🍼", "🥵", "💦", "🍩"] 
        
        # Get the current time
        now = datetime.datetime.now().time()
        # Check if it's past 7pm
        if now.hour >= 19:
            # If it is, choose 3 mischievous emojis at random
            caption_emojis = random.sample(emoji_malicious, 3)
        else:
            # If it's not, choose 3 face emojis at random
            caption_emojis = random.sample(emoji_face, 1) + random.sample(emoji_food, 1) + random.sample(emoji_animal, 1)
        # Return the emojis as a string
        return ''.join(caption_emojis)